{"format": "layers-model", "generatedBy": "keras v2.15.0", "convertedBy": "TensorFlow.js Converter v4.18.0", "modelTopology": {"keras_version": "2.15.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "soc2010_only", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 384], "dtype": "float32", "sparse": false, "ragged": false, "name": "GIST-small-Embedding-v0_title_task_input"}, "name": "GIST-small-Embedding-v0_title_task_input", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "TitleTask_hidden", "trainable": false, "dtype": "float32", "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "TitleTask_hidden", "inbound_nodes": [[["GIST-small-Embedding-v0_title_task_input", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 840], "dtype": "float32", "sparse": false, "ragged": false, "name": "xw_soc2010_input"}, "name": "xw_soc2010_input", "inbound_nodes": []}, {"class_name": "Concatenate", "config": {"name": "all_input", "trainable": true, "dtype": "float32", "axis": -1}, "name": "all_input", "inbound_nodes": [[["TitleTask_hidden", 0, 0, {}], ["xw_soc2010_input", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "soc2010_out", "trainable": true, "dtype": "float32", "units": 840, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "soc2010_out", "inbound_nodes": [[["all_input", 0, 0, {}]]]}], "input_layers": [["GIST-small-Embedding-v0_title_task_input", 0, 0], ["xw_soc2010_input", 0, 0]], "output_layers": [["soc2010_out", 0, 0]]}}, "training_config": {"loss": "binary_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.001, "decay": 0.0, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "TitleTask_hidden/kernel", "shape": [384, 256], "dtype": "float32"}, {"name": "TitleTask_hidden/bias", "shape": [256], "dtype": "float32"}, {"name": "soc2010_out/kernel", "shape": [1096, 840], "dtype": "float32"}, {"name": "soc2010_out/bias", "shape": [840], "dtype": "float32"}]}]}